CREATE TABLE `herb_info` (
                             `id` INT AUTO_INCREMENT,
                             `herb_name` VARCHAR(50),
                             `effects` VARCHAR(500),
                             `origin` VARCHAR(50) ,
                             `stock_quantity` INT,
                             PRIMARY KEY (`id`),
                             UNIQUE KEY `herb_name` (`herb_name`)
);
INSERT INTO `herb_info` (herb_name, effects, origin, stock_quantity) VALUES
                                                                         ('三七', '活血化瘀、减轻疼痛、促进伤口愈合等功效。它常用于治疗外伤出血、心胸疼痛、中风瘫痪等症状', '云南', 100),
                                                                         ('肉桂', '温阳散寒、促进血液循环、消食止痛的作用。常用来治疗风寒感冒、关节痛、腹痛腹泻等症状', '广西', 200),
                                                                         ('何首乌', '滋补肝肾、益精血、乌发延年的功效，适用于治疗血虚头晕、腰膝酸软、白发早生等问题', '贵州', 150),
                                                                         ('党参', '补中益气、健脾养血。它适用于治疗气虚体弱、食欲不振、疲乏无力等症状', '甘肃', 180),
                                                                         ('金银花', '清热解毒、散风退热的作用，常用于治疗风热感冒、咽喉肿痛、高血压等疾病', '山东', 220),
                                                                         ('草乌', '主要用于驱风湿、止痛，特别是对风湿性和寒湿性关节炎有一定的治疗作用。但草乌毒性较大，使用时需谨慎', '黑龙江', 90),
                                                                         ('牛膝', '治疗风湿关节痛、腰膝酸软、利尿消肿等症状', '云南', 120),
                                                                         ('白芷', '驱风解表、减轻头痛、鼻塞等症状，同时也用于美容和皮肤护理', '广西', 150),
                                                                         ('苦参', '清热燥湿、杀虫止痒，常用于治疗湿疹、皮肤炎症等皮肤病', '贵州', 180),
                                                                         ('天麻', '治疗头晕头痛、抗癫痫以及改善神经系统功能', '甘肃', 100),
                                                                         ('桔梗', '清热化痰、利咽解毒。常用于治疗咳嗽、喉咙痛、胸闷等症状', '山东', 200),
                                                                         ('红景天', '提高身体的抗压能力，增强免疫功能，常用于抗疲劳和改善心血管健康', '黑龙江', 130);